import React from 'react';

const Faq = () => {
  return (
    <div className="faq-container">
    <div className="faq-question" style={{textAlign: 'center'}}>
      <h1>Часто задаваемые вопросы</h1>
      </div>
      <div className="faq-question">
        <h3>Как я могу оплатить свой заказ?</h3>
        <p>Мы принимаем различные способы оплаты, включая кредитные карты, PayPal и банковские переводы. Вы можете выбрать подходящий вариант при оформлении заказа.</p>
      </div>
      <div className="faq-question">
        <h3>Каковы сроки доставки?</h3>
        <p>Сроки доставки зависят от вашего местоположения и выбранного способа доставки. Обычно наши заказы обрабатываются в течение 1-3 рабочих дней, а доставка занимает от 5 до 10 рабочих дней.</p>
      </div>
      <div className="faq-question">
        <h3>Могу ли я отследить мой заказ?</h3>
        <p>Да, после оформления заказа вы получите номер отслеживания, который позволит вам следить за статусом вашей посылки.</p>
      </div>
      <div className="faq-question">
        <h3>Как я могу вернуть или обменять товар?</h3>
        <p>Если вы не полностью удовлетворены своим заказом, вы можете вернуть или обменять товар в течение 30 дней с момента получения. Пожалуйста, свяжитесь с нашим отделом обслуживания клиентов для получения дальнейших инструкций.</p>
      </div>
      <div className="faq-question">
        <h3>Как я могу узнать свой размер?</h3>
        <p>Мы предоставляем подробные таблицы размеров для каждого продукта. Пожалуйста, обратитесь к таблице размеров на странице товара, чтобы выбрать подходящий размер.</p>
      </div>
      <div className="faq-question">
        <h3>Какие виды тканей используются в вашей одежде?</h3>
        <p>Мы используем высококачественные ткани и материалы для нашей продукции. Подробная информация о материалах доступна на странице каждого товара.</p>
      </div>
      <div className="faq-question">
        <h3>Как часто обновляется ваш ассортимент?</h3>
        <p>Мы регулярно обновляем наш ассортимент новыми стилями и коллекциями. Подписывайтесь на нашу рассылку, чтобы быть в курсе последних обновлений и специальных предложений.</p>
      </div>
      <div className="faq-question">
        <h3>У вас есть магазины в моем городе?</h3>
        <p>Мы работаем онлайн и не имеем физических магазинов. Но мы доставляем нашу одежду по всему миру, чтобы вы могли наслаждаться нашими товарами, где бы вы ни находились.</p>
      </div>
      <div className="faq-question">
        <h3>Как я могу связаться с вашей службой поддержки?</h3>
        <p>Наша служба поддержки доступна по электронной почте, телефону или через форму обратной связи на нашем сайте. Мы рады помочь вам с любыми вопросами или проблемами.</p>
      </div>
      <div className="faq-question">
        <h3>Как я могу быть в курсе акций и распродаж?</h3>
        <p>Подписывайтесь на нашу рассылку и следите за нашими социальными медиа-аккаунтами, чтобы получать информацию о специальных предложениях, скидках и акциях.</p>
      </div>
    </div>
  );
}

export default Faq;
